#+TITLE: OrgInvest Portfolio Builder
#+PROPERTY: header-args ein-python :session https://localhost:8888/investments.ipynb :noweb yes :tangle yes
** Imports
#+NAME: invest-imports
#+begin_src ein-python :session https://localhost:8888/investments.ipynb :noweb yes
  import pandas as pd
  import numpy as np
  import matplotlib.pyplot as plt
  import pandas_datareader as web
  from datetime import date
  from datetime import datetime
  from dateutil.relativedelta import relativedelta
  import sys
  from loguru import logger
  from collections import deque
  import pprint
  from datetime import date
  from datetime import datetime
  from dateutil.relativedelta import relativedelta
  import os
  from dotenv import load_dotenv

  # Load env file
  load_dotenv()

  logger.add("investments.log",
             #backtrace=True,
             #diagnose=True,
             colorize=True,
             format="<green>{time}</green> <level>{message}</level>")
#+end_src

#+RESULTS: invest-imports
: 1

